<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="javacsript," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E0A;&amp;#x5468;&amp;#x4E00;&amp;#x76F4;&amp;#x5728;&amp;#x505A;B&amp;#x7AD9;&amp;#x70B9;&amp;#x9996;&amp;#x9875;&amp;#xFF0C;&amp;#x771F;&amp;#x7684;&amp;#x505A;&amp;#x7684;&amp;#x5FC3;&amp;#x529B;&amp;#x4EA4;&amp;#x7601;&amp;#x3002;&amp;#x4ECA;&amp;#x5929;&amp;#x4E00">
<meta property="og:type" content="article">
<meta property="og:title" content="关于闭包、闭包应用和ES6的let">
<meta property="og:url" content="http://yoursite.com/2016/09/26/ten/index.html">
<meta property="og:site_name" content="JohanZhu's Blog">
<meta property="og:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E0A;&amp;#x5468;&amp;#x4E00;&amp;#x76F4;&amp;#x5728;&amp;#x505A;B&amp;#x7AD9;&amp;#x70B9;&amp;#x9996;&amp;#x9875;&amp;#xFF0C;&amp;#x771F;&amp;#x7684;&amp;#x505A;&amp;#x7684;&amp;#x5FC3;&amp;#x529B;&amp;#x4EA4;&amp;#x7601;&amp;#x3002;&amp;#x4ECA;&amp;#x5929;&amp;#x4E00">
<meta property="og:updated_time" content="2016-10-17T01:18:42.921Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="关于闭包、闭包应用和ES6的let">
<meta name="twitter:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E0A;&amp;#x5468;&amp;#x4E00;&amp;#x76F4;&amp;#x5728;&amp;#x505A;B&amp;#x7AD9;&amp;#x70B9;&amp;#x9996;&amp;#x9875;&amp;#xFF0C;&amp;#x771F;&amp;#x7684;&amp;#x505A;&amp;#x7684;&amp;#x5FC3;&amp;#x529B;&amp;#x4EA4;&amp;#x7601;&amp;#x3002;&amp;#x4ECA;&amp;#x5929;&amp;#x4E00">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2016/09/26/ten/"/>

  <title> 关于闭包、闭包应用和ES6的let | JohanZhu's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">JohanZhu's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                关于闭包、闭包应用和ES6的let
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-09-26T12:15:09+08:00" content="2016-09-26">
              2016-09-26
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/Javascript学习/" itemprop="url" rel="index">
                    <span itemprop="name">Javascript学习</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h3 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h3><p>&#x4E0A;&#x5468;&#x4E00;&#x76F4;&#x5728;&#x505A;B&#x7AD9;&#x70B9;&#x9996;&#x9875;&#xFF0C;&#x771F;&#x7684;&#x505A;&#x7684;&#x5FC3;&#x529B;&#x4EA4;&#x7601;&#x3002;&#x4ECA;&#x5929;&#x4E00;&#x76F4;&#x89E3;&#x51B3;&#x4E0D;&#x6389;&#x5F39;&#x5E55;&#x5899;&#x7684;BUG&#x3002;&#x65E0;&#x5948;&#x3002;&#x4F11;&#x606F;&#x4E0B;&#x8111;&#x5B50;&#xFF0C;&#x6765;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x4E0A;&#x4E00;&#x7BC7;&#x63D0;&#x5230;&#x7684;&#x95ED;&#x5305;&#x7684;&#x5185;&#x5BB9;&#x3002;<br><a id="more"></a></p>
<h3 id="&#x4EC0;&#x4E48;&#x662F;&#x95ED;&#x5305;&#xFF1F;"><a href="#&#x4EC0;&#x4E48;&#x662F;&#x95ED;&#x5305;&#xFF1F;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;&#x95ED;&#x5305;&#xFF1F;"></a>&#x4EC0;&#x4E48;&#x662F;&#x95ED;&#x5305;&#xFF1F;</h3><p>&#x4EC0;&#x4E48;&#x662F;&#x95ED;&#x5305;&#x5462;&#xFF1F;&#x5148;&#x6765;&#x770B;&#x770B;JS&#x5927;&#x7EA2;&#x4E66;&#x4E0A;&#x7684;&#x89E3;&#x91CA;&#xFF1A;<b>&#x95ED;&#x5305;&#x662F;&#x6307;&#x6709;&#x6743;&#x8BBF;&#x95EE;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x51FD;&#x6570;</b>&#x521B;&#x5EFA;&#x95ED;&#x5305;&#x7684;&#x5E38;&#x89C1;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x521B;&#x5EFA;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x3002;<br>&#x7F51;&#x4E0A;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x7684;&#x6559;&#x7A0B;&#x91CC;&#x4E5F;&#x662F;&#x7528;&#x8FD9;&#x53E5;&#x8BDD;&#x6765;&#x8FDB;&#x884C;&#x7684;&#x6982;&#x62EC;&#x3002;<br>&#x4F46;&#x5176;&#x5B9E;&#x95ED;&#x5305;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x591A;&#x7684;&#x3002;<br>&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x91CC;&#x521B;&#x5EFA;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5C31;&#x662F;&#x95ED;&#x5305;&#x4E86;&#x5417;&#xFF1F;&#x8FD9;&#x4E2A;&#x8BF4;&#x6CD5;&#x5C31;&#x4E0D;&#x59A5;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x6DF1;&#x5165;&#x7684;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x3002;<br>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x660E;&#x767D;&#x7684;&#x662F;&#xFF0C;&#x95ED;&#x5305;&#x7684;&#x6982;&#x5FF5;&#x57FA;&#x4E8E;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#xFF0C;&#x4EE5;&#x53CA;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x673A;&#x5236;&#x3002;<br>&#x4E0A;&#x4E00;&#x7BC7;&#x7684;&#x6587;&#x7AE0;&#x91CC;&#x9762;&#xFF0C;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#x5F53;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x6267;&#x884C;&#x73AF;&#x5883;&#x3002;&#x5728;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4E2D;&#x4F1A;&#x521D;&#x59CB;&#x5316;scopechain&#x5373;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x91CC;&#x53EA;&#x5305;&#x542B;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x3002;&#x5F53;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4F1A;&#x5C06;&#x6B64;&#x51FD;&#x6570;&#x7684;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x8FDB;&#x6765;&#x3002;&#x5F53;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x521B;&#x5EFA;&#x4E86;&#x522B;&#x7684;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x90A3;&#x4E48;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#x4F1A;&#x5C06;&#x5185;&#x90E8;&#x51FD;&#x6570;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x5230;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#x3002;&#x6700;&#x7EC8;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#x5F97;&#x7ED3;&#x6784;&#x5C31;&#x662F;&#xFF0C;&#x4E00;&#x5C42;&#x5957;&#x4E00;&#x5C42;&#x76F4;&#x5230;&#x5168;&#x5C40;&#x7684;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x3002;<br>&#x5F53;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x5C40;&#x90E8;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x4F1A;&#x88AB;&#x9500;&#x6BC1;&#x3002;&#x6700;&#x540E;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5C40;&#x9762;&#xFF1A;&#x5728;&#x5168;&#x5C40;&#x73AF;&#x5883;&#x91CC;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#xFF0C;&#x4F1A;&#x4E00;&#x5C42;&#x4E00;&#x5C42;&#x5265;&#x5F00;&#x3002;&#x6700;&#x540E;&#x5185;&#x5B58;&#x4E2D;&#x4EC5;&#x5269;&#x4E0B;&#x5168;&#x5C40;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x4E86;&#x3002;<br>&#x4F46;&#x662F;&#x95ED;&#x5305;&#x5462;&#xFF1F;&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x5168;&#x5C40;&#x73AF;&#x5883;&#x4E0B;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x7684;&#x5185;&#x5C42;&#x51FD;&#x6570;&#xFF0C;&#x4EA6;&#x6216;&#x8005;&#x662F;&#x5185;&#x5C42;&#x7684;&#x5185;&#x5C42;&#x51FD;&#x6570;&#x5462;&#xFF1F;<br>&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8C03;&#x7528;&#x975E;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x5E76;&#x6267;&#x884C;&#x5B8C;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#xFF0C;&#x975E;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x4F1A;&#x4ECE;&#x6DFB;&#x52A0;&#x5230;&#x9500;&#x6BC1;&#x3002;&#x4F46;&#x662F;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x4E0D;&#x540C;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5916;&#x5C42;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;<b>&#x95ED;&#x5305;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4F1A;&#x4F9D;&#x65E7;&#x8BBF;&#x95EE;&#x7236;&#x7EA7;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;</b>&#x3002;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4EC5;&#x4EC5;&#x662F;&#x6267;&#x884C;&#x5B8C;&#x5916;&#x90E8;&#x51FD;&#x6570;&#xFF0C;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#xFF0C;&#x5916;&#x90E8;&#x51FD;&#x6570;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x662F;&#x4E0D;&#x4F1A;&#x9500;&#x6BC1;&#x7684;&#x3002;&#x3002;&#xFF08;&#x4F46;&#x5176;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x88AB;&#x9500;&#x6BC1;&#xFF09;&#x56E0;&#x4E3A;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x8FD8;&#x8981;&#x8C03;&#x7528;&#x4ED6;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x9500;&#x6BC1;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x624D;&#x4F1A;&#x88AB;&#x9500;&#x6BC1;&#x3002;&#x9500;&#x6BC1;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x624B;&#x52A8;&#x8BBE;&#x7F6E;&#x6765;&#x6E05;&#x9664;&#x5185;&#x5B58;&#x3002;&#x6545;&#xFF0C;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x643A;&#x5E26;&#x7684;&#x5176;&#x7236;&#x7EA7;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x91CC;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x4F1A;&#x4E00;&#x76F4;&#x5360;&#x7528;&#x5185;&#x5B58;&#x3002;<br>&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x4EA7;&#x751F;&#x95ED;&#x5305;&#x5462;&#xFF1F;&#x6211;&#x81EA;&#x5DF1;&#x60F3;&#x4E86;&#x5F88;&#x4E45;&#x3002;&#x3002;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;<br>&#x9996;&#x5148;&#x5148;&#x63D0;&#x4E00;&#x4E0B;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x673A;&#x5236;&#x3002;<br>&#x4E3B;&#x6D41;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x7B56;&#x7565;&#x662F;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x3002;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x4F1A;&#x5C06;&#x8FDB;&#x5165;&#x73AF;&#x5883;&#x7684;&#x53D8;&#x91CF;&#x6807;&#x8BB0;&#x4E3A;&#x201D;&#x8FDB;&#x5165;&#x73AF;&#x5883;&#x201C;&#x3002;&#x5F53;&#x53D8;&#x91CF;&#x79BB;&#x5F00;&#x73AF;&#x5883;&#x65F6;&#xFF0C;&#x6807;&#x8BB0;&#x4E3A;&#x201D;&#x79BB;&#x5F00;&#x73AF;&#x5883;&#x201C;&#x3002;<br>&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4F1A;&#x7ED9;&#x5B58;&#x50A8;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x53D8;&#x91CF;&#x52A0;&#x4E0A;&#x6807;&#x8BB0;&#xFF01;&#x7136;&#x540E;&#xFF0C;&#x4F1A;&#x53BB;&#x6389;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x4E2D;&#xFF0C;&#x4EE5;&#x53CA;&#x88AB;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x5F15;&#x7528;&#x7684;&#x6807;&#x8BB0;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x88AB;&#x52A0;&#x4E0A;&#x6807;&#x8BB0;&#x7684;&#x53D8;&#x91CF;&#x4F1A;&#x88AB;&#x89C6;&#x4E3A;&#x51C6;&#x5907;&#x5220;&#x9664;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x539F;&#x56E0;&#x662F;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5230;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x4E86;&#x3002;<br>&#x8FD9;&#x4E2A;&#x673A;&#x5236;&#x770B;&#x4E0A;&#x5F88;&#x62D7;&#x53E3;&#x3002;&#x5176;&#x5B9E;&#x8BF4;&#x767D;&#x4E86;&#x3002;&#x79BB;&#x5F00;&#x73AF;&#x5883;&#x540E;&#x4E0D;&#x7528;&#x4E86;&#x5C31;&#x4F1A;&#x88AB;&#x4E22;&#x6389;&#x3002;&#x6807;&#x8BB0;&#x7684;&#x65B9;&#x5F0F;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x3002;&#x4E22;&#x6389;&#x7684;&#x4E1C;&#x897F;&#x4F1A;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x88AB;&#x6E05;&#x9664;&#x3002;&#x4F46;&#x662F;&#x5462;&#xFF1F;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x7684;&#x51FD;&#x6570;&#x82E5;&#x662F;&#x5F15;&#x7528;&#x4E86;&#x7236;&#x7EA7;&#x51FD;&#x6570;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x8BDD;&#xFF0C;&#x5F53;&#x7236;&#x7EA7;&#x7684;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x5DE5;&#x4F5C;&#x6D41;&#x79BB;&#x5F00;&#x6B64;&#x73AF;&#x5883;&#x7684;&#x65F6;&#x5019;&#x7236;&#x7EA7;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x82E5;&#x662F;&#x6E05;&#x9664;&#x4E86;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x5C31;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5230;&#x4ED6;&#x4EEC;&#x4E86;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x7236;&#x7EA7;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x4E2D;&#x88AB;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x5F15;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x662F;&#x8FD8;&#x8981;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x82E5;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x4E0D;&#x624B;&#x52A8;&#x7F6E;&#x7A7A;&#x7684;&#x8BDD;&#xFF0C;&#x5B83;&#x6240;&#x5F15;&#x7528;&#x7684;&#x7236;&#x7EA7;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x4E2D;&#x76F8;&#x5E94;&#x7684;&#x53D8;&#x91CF;&#x5C31;&#x4F1A;&#x88AB;&#x4FDD;&#x7559;&#x4E0B;&#x6765;&#xFF0C;&#x4E00;&#x76F4;&#x653E;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x5360;&#x7528;&#x7740;&#x5185;&#x5B58;&#x3002;<br>&#x597D;&#x4E86;&#x3002;&#x5173;&#x4E8E;&#x95ED;&#x5305;&#x6211;&#x7684;&#x7406;&#x89E3;&#x5C31;&#x662F;&#x5982;&#x6B64;&#x4E86;&#x3002;&#x800C;&#x5B83;&#x7A76;&#x7ADF;&#x6709;&#x4EC0;&#x4E48;&#x5E94;&#x7528;&#x5462;&#xFF1F;</p>
<h3 id="&#x95ED;&#x5305;&#x7684;&#x5E94;&#x7528;"><a href="#&#x95ED;&#x5305;&#x7684;&#x5E94;&#x7528;" class="headerlink" title="&#x95ED;&#x5305;&#x7684;&#x5E94;&#x7528;"></a>&#x95ED;&#x5305;&#x7684;&#x5E94;&#x7528;</h3><p>&#x5173;&#x4E8E;&#x5E94;&#x7528;&#x3002;&#x6700;&#x5148;&#x6765;&#x8BF4;&#x4E00;&#x4E0B;&#x6211;&#x5728;&#x6211;&#x505A;&#x8FC7;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x5E94;&#x7528;&#x7684;&#x51E0;&#x4E2A;&#x5730;&#x65B9;&#x5427;~<br>&#x5F39;&#x5E55;&#x5899;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#xFF08;&#x4E0E;JS&#x5927;&#x7EA2;&#x4E66;&#x4E0A;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x7B97;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x7247;&#x7684;&#x7528;&#x6CD5;&#x4E86;~&#xFF09;&#xFF1A;</p>
<pre><code>   $(&apos;video&apos;)[0].addEventListener(&apos;play&apos;,function(){
    for(var i = 0;i &lt; delayTimeArr.length;i++){
    //&#xFF08;&#x4E0B;&#x9762;&#x521B;&#x5EFA;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x4EE5;&#x8BFB;&#x53D6;for&#x5FAA;&#x73AF;&#x5185;&#x7684;&#x6570;&#x503C;
    /*&#x5EF6;&#x8FDF;&#x53D1;&#x5C04;&#x5F39;&#x5E55;&#xFF0C;&#x5EF6;&#x8FDF;&#x65F6;&#x95F4;&#x4E0E;&#x5F39;&#x5E55;&#x5185;&#x5BB9;&#x8BFB;&#x53D6;&#x81EA;&#x672C;&#x5730;&#x5B58;&#x50A8;&#xFF0C;&#x4E5F;&#x4E45;&#x662F;&#x4E0A;&#x8FF0;&#x6570;&#x7EC4;&#x53D6;&#x7684;&#x5185;&#x5BB9;*/
    (function(num){
    setTimeout(function(){
        $(&apos;&lt;div class=&quot;floatBullet&quot; style=&quot;top:&apos;+randomTop+&apos;px&apos;+&apos;&quot;&gt;&apos;+contentArr[num]+&apos;&lt;/div&gt;&apos;).appendTo($(&apos;.border&apos;));
    },delayTimeArr[i]);
    })(i);//&#x95ED;&#x5305;&#x51FD;&#x6570;&#x7ED3;&#x675F;    

  }//for&#x5FAA;&#x73AF;&#x7ED3;&#x675F;
});
</code></pre><p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x628A;&#x5386;&#x53F2;&#x5F39;&#x5E55;&#x7684;&#x53D1;&#x9001;&#x65F6;&#x95F4;&#xFF08;&#x57FA;&#x4E8E;&#x89C6;&#x9891;&#x7684;&#x65F6;&#x95F4;&#xFF09;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5386;&#x53F2;&#x5F39;&#x5E55;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x5EF6;&#x8FDF;&#x53D1;&#x9001;&#x51FA;&#x6765;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;ES5&#x7684;&#x6807;&#x51C6;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x51FD;&#x6570;&#x624D;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x3002;for&#x5FAA;&#x73AF;&#x7ED3;&#x675F;&#x540E;i=10,&#x6211;&#x4EEC;&#x5185;&#x90E8;&#x7684;&#x51FD;&#x6570;&#x662F;&#x53EA;&#x80FD;&#x8BFB;&#x53D6;&#x5230; i = 10&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x4FDD;&#x7559;&#x5728;&#x7236;&#x7EA7;&#x51FD;&#x6570;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;i&#x662F;&#x7236;&#x7EA7;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;i&#x7684;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;10&#x3002;&#x90A3;&#x4E48;&#x4E3A;&#x4E86;&#x53D6;&#x5230;for&#x5FAA;&#x73AF;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;i&#x503C;&#xFF0C;&#x6211;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x518D;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x95ED;&#x5305;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x5C42;&#x95ED;&#x5305;&#x4E2D;&#x6211;&#x4EEC;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x53C2;&#x6570;num&#xFF0C;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x95ED;&#x5305;&#x4E5F;&#x5C31;&#x662F;&#x7B2C;&#x4E8C;&#x5C42;&#x95ED;&#x5305;&#x4E2D;&#x6211;&#x4EEC;&#x5F15;&#x7528;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x6211;&#x4EEC;&#x5728;&#x81EA;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x628A;i&#x4F20;&#x9012;&#x8FDB;&#x53BB;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x5185;&#x90E8;&#x7684;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x4FDD;&#x7559;&#x4E86;&#x7B2C;&#x4E00;&#x5C42;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;num&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;num&#x662F;for&#x5728;&#x5FAA;&#x73AF;&#x65F6;&#x6240;&#x4F20;&#x9012;&#x8FDB;&#x6765;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;i&#x7684;&#x503C;&#x3002;&#x5373;&#xFF1A;</p>
<pre><code>(function(num){
setTimeout(function(){
    $(&apos;&lt;div class=&quot;floatBullet&quot; style=&quot;top:&apos;+randomTop+&apos;px&apos;+&apos;&quot;&gt;&apos;+contentArr[num]+&apos;&lt;/div&gt;&apos;).appendTo($(&apos;.border&apos;));
},delayTimeArr[i]);
})(i);
</code></pre><p>&#x5173;&#x4E8E;for&#x548C;&#x95ED;&#x5305;&#x8FD8;&#x6709;&#x81EA;&#x6267;&#x884C;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x88AB;ES6&#x6807;&#x51C6;&#x6240;&#x6DD8;&#x6C70;&#x4E86;&#x3002;&#x3002;&#x3002;&#x3002;<br>&#x63A5;&#x4E0B;&#x6765;&#x770B;&#x770B;&#x5176;&#x4ED6;&#x7684;&#x4F5C;&#x7528;&#x628A;&#xFF1A;<br>&#x5B9E;&#x73B0;&#x5C01;&#x88C5;&#x4E0E;&#x6A21;&#x5757;&#x5316;&#xFF1A; </p>
<pre><code>var person = function(){
var name = &quot;moren;
return {
       getName : function(){
              return name;
       }
       setName : function(newName){
                name = newName;
       }
}
}();
console.log(person.name);//&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#xFF0C;&#x7ED3;&#x679C;&#x4E3A;undefined    
  console.log(person.getName());  //default 
  person.setName(&quot;jozo&quot;);    
 console.log(person.getName());  //jozo
</code></pre><p> &#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;&#x81EA;&#x6267;&#x884C;&#x548C;&#x95ED;&#x5305;&#x662F;&#x6CA1;&#x6709;&#x5FC5;&#x7136;&#x8054;&#x7CFB;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x4ED6;&#x603B;&#x662F;&#x4E0E;&#x95ED;&#x5305;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x800C;&#x5DF2;&#x3002;<br>       &#x79C1;&#x6709;&#x5316;&#x53D8;&#x91CF;&#xFF1A;<br>       &#x53EA;&#x8981;&#x662F;&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5E73;&#x7EA7;&#x4E0E;&#x9AD8;&#x7EA7;&#x7684;&#x51FD;&#x6570;&#x662F;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5176;&#x4E2D;&#x53D8;&#x91CF;&#x7684;&#xFF0C;&#x53EA;&#x80FD;&#x4E3A;&#x81EA;&#x5DF1;&#x548C;&#x81EA;&#x5DF1;&#x5185;&#x90E8;&#x7684;&#x51FD;&#x6570;&#x6240;&#x7528;&#x3002;&#x800C;&#x51FD;&#x6570;&#x5185;&#x90E8;getName&#x548C;setName&#x662F;&#x53EF;&#x8BBF;&#x95EE;&#x5230;&#x5185;&#x90E8;&#x7684;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#x7684;&#x3002;&#xFF08;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x53C8;&#x662F;&#x80FD;&#x591F;&#x88AB;&#x5916;&#x90E8;&#x6240;&#x8C03;&#x7528;&#x7684;&#x3002;&#xFF09;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x7684;&#x5B9A;&#x4E49;&#x7279;&#x6743;&#x51FD;&#x6570;&#x53BB;&#x8BBF;&#x95EE;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x4E0D;&#x901A;&#x8FC7;&#x7279;&#x6743;&#x51FD;&#x6570;&#x662F;&#x65E0;&#x6CD5;&#x53BB;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#x7684;&#x3002;<br>       &#x81EA;&#x6267;&#x884C;&#x7684;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x6A21;&#x4EFF;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#xFF1A;<br>       &#x5728;&#x81EA;&#x6267;&#x884C;&#x7684;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x5185;&#x6240;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x662F;&#x4E0D;&#x80FD;&#x88AB;&#x5916;&#x90E8;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5229;&#x7528;&#x51FD;&#x6570;&#x7684;&#x81EA;&#x6267;&#x884C;&#xFF0C;&#x4EE5;&#x53CA;JS&#x4E2D;&#x53EA;&#x6709;&#x51FD;&#x6570;&#x624D;&#x62E5;&#x6709;&#x6267;&#x884C;&#x73AF;&#x5883;&#x7684;&#x7279;&#x8D28;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x6A21;&#x4EFF;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x3002;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x5728;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4F1A;&#x88AB;&#x9500;&#x6BC1;&#xFF0C;&#x4E0D;&#x4F1A;&#x6C61;&#x67D3;&#x5168;&#x5C40;&#x3002;&#x5728;&#x591A;&#x4EBA;&#x5F00;&#x53D1;&#x7684;&#x5927;&#x578B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x9EBB;&#x70E6;&#x3002;<br>      &#x9759;&#x6001;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#xFF1A;<br>      &#x5728;&#x81EA;&#x6267;&#x884C;&#x51FD;&#x6570;&#x5185;&#x90E8;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x518D;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#x63A5;&#x7740;&#x901A;&#x8FC7;&#x539F;&#x578B;&#x6765;&#x7ED9;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6DFB;&#x52A0;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x6DFB;&#x52A0;&#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x7528;&#x4E4B;&#x524D;&#x5B9A;&#x4E49;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x90FD;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x8BBF;&#x95EE;&#x5230;&#x8FD9;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E86;&#xFF01;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x7684;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#x3002;&#x82E5;&#x662F;&#x901A;&#x8FC7;this&#x6765;&#x6DFB;&#x52A0;&#x65B9;&#x6CD5;&#x7684;&#x8BDD;&#xFF0C;&#x5728;&#x5B9E;&#x4F8B;&#x5316;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x91CD;&#x5199;&#x5C5E;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x5F15;&#x7528;&#x5230;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5C31;&#x5C5E;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x516C;&#x6709;&#x7684;&#x4E86;&#x3002;&#xFF08;&#x8FD9;&#x91CC;&#x8BB2;&#x7684;&#x6709;&#x70B9;&#x6666;&#x6DA9;&#x3002;&#x3002;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x6211;&#x518D;&#x8865;&#x4E86;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E0E;&#x7EE7;&#x627F;&#x7684;&#x6982;&#x5FF5;&#x540E;&#x624D; &#x5199;&#x7684;&#x3002;&#xFF09;<br>      &#x6A21;&#x5757;&#x6A21;&#x5F0F;&#xFF1A;</p>
<pre><code> var Module = (function() {
   // &#x4E0B;&#x9762;&#x51FD;&#x6570;&#x662F;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x88AB;&#x516C;&#x5F00;&#x51FD;&#x6570;&#x8BBF;&#x95EE;
 function privateFunc() { &#x2026; };

 // &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x8D4B;&#x4E88;Module
return {
  publicFunc: function() {
    privateFunc(); // publicFunc&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;privateFunc
}
};
}());
</code></pre><p>&#x8FD9;&#x91CC;COPY&#x4E86;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E5F;&#x662F;&#x5927;&#x7EA2;&#x4E66;&#x4E0A;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x901A;&#x8FC7;&#x5728;&#x81EA;&#x6267;&#x884C;&#x51FD;&#x6570;&#x7684;&#x5185;&#x90E8;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5B57;&#x9762;&#x91CF;&#x5BF9;&#x8C61;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;{}&#x7684;&#x5F62;&#x5F0F;&#x8868;&#x793A;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x81EA;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x901A;&#x8FC7;Module.publicFuc&#x6765;&#x4F7F;&#x7528;&#x5C01;&#x88C5;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x5230;&#x6A21;&#x4EFF;&#x7684;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;<br>        &#x589E;&#x5F3A;&#x6A21;&#x5757;&#x6A21;&#x5F0F;&#xFF1A;<br>        &#x7B80;&#x5355;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x518D;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF1A;var obj = new object();&#x7136;&#x540E;&#x5728;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x4E0A;&#x53BB;&#x5B9A;&#x4E49;&#x65B9;&#x6CD5;&#x3002;&#x6700;&#x540E;&#x5C06;&#x5176;&#x8FD4;&#x56DE;&#x3002;&#x8FD9;&#x91CC;&#x7684; object&#x53EF;&#x4EE5;&#x662F;&#x5176;&#x4ED6;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x8FD0;&#x7528;&#x573A;&#x5408;&#x663E;&#x800C;&#x6613;&#x89C1;&#x3002;&#x3002;&#x5C31;&#x662F;&#x5E0C;&#x671B;&#x8FD4;&#x56DE;&#x7684;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5B83;&#x5DF2;&#x7ECF;&#x662F;&#x67D0;&#x4E00;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x5176;&#x4ED6;&#x7684;&#x5C5E;&#x6027;&#x6216;&#x8005;&#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<h3 id="&#x5173;&#x4E8E;ES6&#x91CC;&#x7684;let"><a href="#&#x5173;&#x4E8E;ES6&#x91CC;&#x7684;let" class="headerlink" title="&#x5173;&#x4E8E;ES6&#x91CC;&#x7684;let"></a>&#x5173;&#x4E8E;ES6&#x91CC;&#x7684;let</h3><p>   &#x5927;&#x7EA2;&#x4E66;&#x91CC;&#x8BF4;&#x8FC7;Javascript&#x91CC;&#x6CA1;&#x6709;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x3002;&#x4F46;&#x662F;ES6&#x6807;&#x51C6;&#x4E2D;&#x5C31;&#x8D4B;&#x4E88;&#x4E86;JS&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#xFF01;<br>   &#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4F7F;&#x7528;let&#x6765;&#x58F0;&#x660E;&#x53D8;&#x91CF;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;<br>   let&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;&#x5F52;&#x5C5E;&#x5728;&#x4ED6;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x4E2A;&#x5927;&#x62EC;&#x53F7;&#x91CC;&#x3002;<br>   &#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5F39;&#x5E55;&#x5899;&#x529F;&#x80FD;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x5C31;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x4E00;&#x4E0B;&#x6539;&#x5199;&#x4E86;~</p>
<pre><code>for(let i = 0;i &lt; delayTimeArr.length;i++){
             setTimeout(
             function(){
                   $(&apos;&lt;div class=&quot;floatBullet&quot;                     style=&quot;top:&apos;+randomTop+&apos;px&apos;+&apos;&quot;&gt;&apos;+contentArr[num]+&apos;&lt;/div&gt;&apos;).appendTo($(&apos;.border&apos;));    
             }
             ,delayTimeArr[i]);
}  
</code></pre><p> &#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x901A;&#x8FC7;(function(){})()&#x6765;&#x6A21;&#x4EFF;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;let&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;i&#x662F;&#x5C5E;&#x4E8E;&#x9760;&#x7684;&#x6700;&#x8FD1;&#x7684;&#x5927;&#x62EC;&#x53F7;&#x7684;&#x3002;&#x5E76;&#x4E14;&#x5728;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;i&#x4F1A;&#x88AB;&#x56DE;&#x6536;~&#xFF08;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#xFF09;<br>&#x5173;&#x4E8E;let&#x8FD8;&#x6709;&#x51E0;&#x4E2A;&#x7279;&#x6027;&#xFF1A;<br>&#x4E0D;&#x5B58;&#x5728;&#x53D8;&#x91CF;&#x63D0;&#x5347;&#x73B0;&#x8C61;&#x3002;<br>&#x4E0D;&#x53EF;&#x4EE5;&#x91CD;&#x590D;&#x7684;&#x58F0;&#x660E;&#x3002;&#x5305;&#x62EC;&#x4E0D;&#x80FD;&#x5148;var a=1;&#x518D;let a=1;<br>&#x4E0D;&#x80FD;let a= 1;let a =2&#xFF1B;&#x8FD9;&#x6837;&#x90FD;&#x4F1A;&#x62A5;&#x9519;&#xFF01;&#x8FD8;&#x6709;&#x4E0D;&#x80FD;&#x518D;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x91CD;&#x590D;&#x58F0;&#x660E;<br>&#x4F8B;&#x5982;</p>
<pre><code>function func(a){
           let a ;//&#x62A5;&#x9519;
}
function func(a){
{
      let a;//&#x4E0D;&#x62A5;&#x9519;
}
}
</code></pre><p>&#x539F;&#x56E0;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#x51FD;&#x6570;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x76F8;&#x5F53;&#x4E8E;&#x5728;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;&#x518D;&#x7528;Let&#x5F53;&#x7136;&#x4F1A;&#x62A5;&#x9519;&#x3002;&#x7136;&#x540E;&#x5982;&#x679C;&#x52A0;&#x4E00;&#x4E2A;&#x62EC;&#x53F7;&#xFF0C;&#x90A3;&#x4E48;Let&#x5C31;&#x5F52;&#x5C5E;&#x4E0E;&#x5B83;&#x4E86;~&#x5C31;&#x4E0D;&#x4F1A;&#x62A5;&#x9519;&#x4E86;&#x3002;<br>&#x6682;&#x6B7B;&#x6027;&#x533A;&#x57DF;&#xFF1A;<br>&#x53EA;&#x8981;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x5B58;&#x5728;Let&#x547D;&#x4EE4;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x6240;&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;&#x5C31;&#x7ED1;&#x5B9A;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x4E0D;&#x518D;&#x53D7;&#x5916;&#x90E8;&#x5F71;&#x54CD;&#x3002;</p>
<pre><code>var  a =  1;
if (1 ){
         a = &apos;abc&apos;;//ReferenceError
         let tmp;
}
</code></pre><p> &#x6682;&#x6B7B;&#x533A;&#x57DF;&#x662F;&#x4ECE;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x5F00;&#x59CB;&#x4E00;&#x76F4;&#x5230;Let&#x547D;&#x4EE4;&#x7ED3;&#x675F;&#x3002;<br>&#x8FD9;&#x6837;&#x4E00;&#x6765;&#x3002;&#x3002;typeof &#x4E5F;&#x4F1A;&#x62A5;&#x9519;&#x4E86;&#x3002;&#x53EA;&#x8981;&#x4F60;&#x5728;&#x6B7B;&#x533A;&#x91CC;&#x9762;&#x3002;&#x3002;&#x3002;<br>&#x6700;&#x540E;&#x6709;&#x4E9B;&#x6B7B;&#x533A;&#x5F88;&#x9690;&#x853D;&#xFF1A;</p>
<pre><code>function bar (x = y , y = 2){
              return [x,y];
}
bar();//error
</code></pre><p> &#x8FD9;&#x662F;&#x56E0;&#x4E3A; y &#x662F;&#x8981;&#x8D4B;&#x503C;&#x7ED9;x&#x7684;&#xFF0C;&#x7136;&#x800C;y&#x5728;&#x540E;&#x9762;&#x4E00;&#x53E5;&#x624D;&#x58F0;&#x660E;&#xFF0C;&#x6240;&#x4EE5;&#x3002;&#x3002;&#x3002;<br> &#x4F46;&#x662F;&#x5982;&#x679C;&#x5148;&#x6052;&#x660E;x =2 ; &#x518D; y = x&#xFF1B;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;<br> &#x7136;&#x540E;&#xFF0C;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x662F;&#x53EF;&#x4EE5;&#x5D4C;&#x5957;&#x7684;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x8C28;&#x8BB0;&#xFF0C;&#x5B83;&#x5C0A;&#x5D07;let&#x5F52;&#x5C5E;&#x4E8E;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x4E2A;&#x5927;&#x62EC;&#x53F7;&#x5C31;&#x53EF;&#x4EE5;&#x5566;~<br> &#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x4E0E;&#x51FD;&#x6570;&#x58F0;&#x660E;&#xFF1A;<br> ES5&#x4E2D;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x5728;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x58F0;&#x660E;&#x51FD;&#x6570;&#x662F;&#x4E0D;&#x5408;&#x6CD5;&#x7684;&#x3002;<br> &#x4F46;&#x662F;ES6&#x5C31;&#x76F8;&#x53CD;&#x4E86;&#x3002;<br> &#x4F46;&#x662F;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x58F0;&#x660E;&#x7684;&#x51FD;&#x6570;&#x4E0D;&#x4F1A;&#x88AB;&#x63D0;&#x5347;&#xFF01;&#x4E5F;&#x65E0;&#x6CD5;&#x88AB;&#x5916;&#x90E8;&#x6240;&#x5F15;&#x7528;&#xFF01;</p>
<h3 id="&#x7ED3;&#x8BED;"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED;</h3><p> &#x95ED;&#x5305;&#x770B;&#x5230;&#x4E00;&#x534A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5927;&#x7EA2;&#x4E66;&#x8BFB;&#x7684;&#x4E0D;&#x900F;&#x5F7B;&#x3002;&#x53C8;&#x53CD;&#x8FC7;&#x53BB;&#x8FC7;&#x4E86;&#x4E00;&#x904D;&#x7B2C;&#x516D;&#x7AE0;= =&#xFF0C;&#x603B;&#x7B97;&#x603B;&#x7ED3;&#x5B8C;&#x4E86;&#x3002;<br> &#x4E0B;&#x4E00;&#x7BC7;&#x8C08;&#x4E00;&#x8C08;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5427;~&#x8C08;&#x4E00;&#x4E9B;&#x6211;&#x81EA;&#x5DF1;&#x5BF9;&#x4E8E;JS&#x4E2D;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7406;&#x89E3;&#xFF08;&#x6211;&#x89C9;&#x5F97;JS&#x91CC;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x51FD;&#x6570;&#x3002;&#x3002;&#x3002;&#x3002;&#x80BF;&#x4E48;&#x7834;&#x3002;&#x3002;&#x3002;&#xFF09;</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/javacsript/" rel="tag">#javacsript</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/05/nine-post/" rel="next" title="Essay">
                <i class="fa fa-chevron-left"></i> Essay
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/10/10/eleven/" rel="prev" title="有关面向对象与继承的总结">
                有关面向对象与继承的总结 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://raw.githubusercontent.com/johanzhu/johanzhu.github.io/master/images/avatar.PNG"
               alt="Johan Zhu" />
          <p class="site-author-name" itemprop="name">Johan Zhu</p>
          <p class="site-description motion-element" itemprop="description">Time you enjoy wasting, was not wasted.</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">22</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">5</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">5</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#前言"><span class="nav-number">1.</span> <span class="nav-text">前言</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#什么是闭包？"><span class="nav-number">2.</span> <span class="nav-text">什么是闭包？</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#闭包的应用"><span class="nav-number">3.</span> <span class="nav-text">闭包的应用</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#关于ES6里的let"><span class="nav-number">4.</span> <span class="nav-text">关于ES6里的let</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#结语"><span class="nav-number">5.</span> <span class="nav-text">结语</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Johan Zhu</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  
  

  

  

</body>
</html>
