<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="javascript," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E4B;&amp;#x524D;&amp;#x5728;&amp;#x77E5;&amp;#x4E4E;&amp;#x4E0A;&amp;#x770B;&amp;#x5230;&amp;#x522B;&amp;#x4EBA;&amp;#x5206;&amp;#x4EAB;&amp;#x4E00;&amp;#x4E2A;&amp;#x9762;&amp;#x8BD5;&amp;#x9898;&amp;#x76EE;&amp;#x662F;&amp;#x5199;&amp;#x4E00;&amp;#x4E2A;&amp;#x51FD;">
<meta property="og:type" content="article">
<meta property="og:title" content="有关面向对象与继承的总结">
<meta property="og:url" content="http://yoursite.com/2016/10/10/eleven/index.html">
<meta property="og:site_name" content="JohanZhu's Blog">
<meta property="og:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E4B;&amp;#x524D;&amp;#x5728;&amp;#x77E5;&amp;#x4E4E;&amp;#x4E0A;&amp;#x770B;&amp;#x5230;&amp;#x522B;&amp;#x4EBA;&amp;#x5206;&amp;#x4EAB;&amp;#x4E00;&amp;#x4E2A;&amp;#x9762;&amp;#x8BD5;&amp;#x9898;&amp;#x76EE;&amp;#x662F;&amp;#x5199;&amp;#x4E00;&amp;#x4E2A;&amp;#x51FD;">
<meta property="og:updated_time" content="2016-10-11T06:57:15.198Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="有关面向对象与继承的总结">
<meta name="twitter:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E4B;&amp;#x524D;&amp;#x5728;&amp;#x77E5;&amp;#x4E4E;&amp;#x4E0A;&amp;#x770B;&amp;#x5230;&amp;#x522B;&amp;#x4EBA;&amp;#x5206;&amp;#x4EAB;&amp;#x4E00;&amp;#x4E2A;&amp;#x9762;&amp;#x8BD5;&amp;#x9898;&amp;#x76EE;&amp;#x662F;&amp;#x5199;&amp;#x4E00;&amp;#x4E2A;&amp;#x51FD;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2016/10/10/eleven/"/>

  <title> 有关面向对象与继承的总结 | JohanZhu's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">JohanZhu's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                有关面向对象与继承的总结
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-10-10T14:23:43+08:00" content="2016-10-10">
              2016-10-10
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/Javascript学习/" itemprop="url" rel="index">
                    <span itemprop="name">Javascript学习</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h3 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h3><p>&#x4E4B;&#x524D;&#x5728;&#x77E5;&#x4E4E;&#x4E0A;&#x770B;&#x5230;&#x522B;&#x4EBA;&#x5206;&#x4EAB;&#x4E00;&#x4E2A;&#x9762;&#x8BD5;&#x9898;&#x76EE;&#x662F;&#x5199;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5176;&#x4E2D;&#x62E5;&#x6709;&#xFF1A;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#xFF0C;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#xFF0C;&#x516C;&#x6709;&#x65B9;&#x6CD5;&#xFF0C;&#x516C;&#x6709;&#x53D8;&#x91CF;&#x3002;&#x770B;&#x5230;&#x4EE5;&#x540E;&#x624D;&#x53D1;&#x73B0;&#xFF0C;&#x81EA;&#x5DF1;&#x5927;&#x7EA2;&#x4E66;&#x7B2C;&#x516D;&#x7AE0;&#x770B;&#x7684;&#x4E0D;&#x4ED4;&#x7EC6;&#x3002;&#x3002;&#x8FD9;&#x91CC;&#x6765;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x5427;~&#x6BD5;&#x7ADF;&#x662F;&#x57FA;&#x7840;&#x4E2D;&#x7684;&#x57FA;&#x7840;&#x3002;<br><a id="more"></a></p>
<h3 id="JS&#x5BF9;&#x8C61;&#x6784;&#x5EFA;"><a href="#JS&#x5BF9;&#x8C61;&#x6784;&#x5EFA;" class="headerlink" title="JS&#x5BF9;&#x8C61;&#x6784;&#x5EFA;"></a>JS&#x5BF9;&#x8C61;&#x6784;&#x5EFA;</h3><p>&#x5728;JS&#x4E2D;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x53EA;&#x9700;&#x8981;&#x5F88;&#x7B80;&#x5355;&#x7684;</p>
<pre><code>var  person=new Object();
person.name = &quot;johan&quot;;
person.age = &quot;29&quot;;
person.height = &quot;175&quot;;
person.sayName = function(){
           alert(this.name);
};
</code></pre><p>&#x5F53;&#x7136;&#x8FD9;&#x662F;&#x6700;&#x521D;&#x7684;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x5199;&#x6CD5;&#xFF0C;&#x4E4B;&#x540E;&#x5BF9;&#x8C61;&#x5B57;&#x9762;&#x6210;&#x4E3A;&#x4E86;&#x4E3B;&#x6D41;&#x7684;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;</p>
<pre><code>var person = {
     name : &quot;johan&quot;,
     age: 23,
     height : 175;
     sayName : function(){
        alert(this.name);
     }
};
</code></pre><p>&#x800C;&#x8FD9;&#x6837;&#x5B50;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x5B58;&#x5728;&#x95EE;&#x9898;&#xFF1A;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x521B;&#x5EFA;&#x5F88;&#x591A;&#x5BF9;&#x8C61;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x5927;&#x91CF;&#x91CD;&#x590D;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4EBA;&#x4EEC;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF08;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#xFF09;&#x7684;&#x4E00;&#x79CD;&#x53D8;&#x4F53;&#x6765;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#xFF1A;</p>
<pre><code>function createPerson(name,age,height){
var o = new Object()&#xFF1B;
o.name = &quot;johan&quot;;
o.age = 23;
o.height = 175;
o.sayName = function(){
        alert(this.name);  
}
}
</code></pre><p>&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x53EA;&#x9700;&#x8981;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x51FD;&#x6570;</p>
<pre><code>var person1 = createPerson(&quot;johan&quot;,&quot;23&quot;,&quot;175&quot;);
var person2 = createPerson(&quot;vicent&quot;,&quot;21&quot;,&quot;183&quot;);
</code></pre><p>&#x5F53;&#x7136;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x5BF9;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x6539;&#x5199;&#xFF1A;</p>
<pre><code>function Person(name,age,height){
   this.name = name;
   this.age = age;
   this.height = height;
   this.sayName = function(){
            alert(this.name);
   };
};

var person1 = new Peron(&quot;johan&quot;,23,&quot;175&quot;);
var person2 = new Person(&quot;vicent&quot;,27&#xFF0C;&#x201C;184&#x201D;)&#xFF1B;
</code></pre><p>&#x8FD9;&#x6837;&#x5B50;&#x5199;&#x5C31;&#x6E05;&#x723D;&#x591A;&#x4E86;~&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x663E;&#x793A;&#x7684;&#x53BB;var Object&#xFF0C;&#x800C;&#x4E14;&#x76F4;&#x63A5;&#x628A;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x76F4;&#x63A5;&#x8D4B;&#x7ED9;&#x4E86;this&#x3002;&#x800C;&#x4E14;&#x8FD8;&#x6CA1;&#x6709;return&#x8BED;&#x53E5;&#x3002;&#xFF08;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#xFF0C;&#x5F00;&#x5934;&#x5B57;&#x6BCD;&#x9700;&#x8981;&#x5927;&#x5199;&#xFF01;&#xFF09;<br>&#x6211;&#x4EEC;&#x7528;&#x5B83;&#x521B;&#x5EFA;&#x5B9E;&#x4F8B;&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x7528;new&#x64CD;&#x4F5C;&#x7B26;&#xFF1A;<br>new&#x5E72;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E4B;&#x524D;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x4E5F;&#x603B;&#x7ED3;&#x8FC7;&#xFF08;&#x628A;&#x5B83;&#x8D34;&#x8FC7;&#x6765;&#xFF09;&#xFF1A;<br>1.&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x7684;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x662F;object.<br>2.&#x8BBE;&#x7F6E;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x90E8;&#x3001;&#x53EF;&#x8BBF;&#x95EE;&#x6027;&#x3001;&#x548C;[prototype]&#x5C5E;&#x6027;&#x4E3A;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF08;&#x6307;prototype.constructor&#x6240;&#x6307;&#x5411;&#x7684;&#x51FD;&#x6570;&#xFF09;&#x4E2D;&#x8BBE;&#x7F6E;&#x7684;&#xFF1B;<br>3.&#x6267;&#x884C;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x5F53;this&#x5173;&#x952E;&#x5B57;&#x88AB;&#x63D0;&#x53CA;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x65B0;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#xFF1B;<br>4.&#x8FD4;&#x56DE;&#x65B0;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x9664;&#x975E;&#x6784;&#x9020;&#x65B9;&#x6CD5;&#x4E2D;&#x8FD4;&#x56DE;&#x7684;&#x662F;&#x2019;&#x65E0;&#x539F;&#x578B;&#x2019;&#xFF09;&#x3002;<br>&#x8FD9;&#x8DDF;&#x4E66;&#x4E2D;&#x603B;&#x7ED3;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#xFF0C;&#x7ED1;&#x5B9A;this,&#x8D4B;&#x4E88;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;<em>protol</em>&#x3002;<br>&#x90A3;&#x4E48;&#x8FD9;&#x91CC;&#x7684;protol&#x7684;&#x518D;&#x6307;&#x5B9A;&#x5C31;&#x521B;&#x9020;&#x51FA;&#x4E86;&#x539F;&#x578B;&#x94FE;&#xFF01;&#xFF01;&#xFF01;&#x6BCF;new&#x4E00;&#x6B21;&#xFF0C;&#x8FD9;&#x6761;&#x94FE;&#x5C31;&#x4F1A;&#x53D8;&#x957F;&#x4E00;&#x8282;&#x3002;<br>TIP:&#x5982;&#x679C;&#x4E0D;&#x662F;&#x7528;new&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;this&#x4F1A;&#x6307;&#x5411;window&#x3002;<br>&#x4F46;&#x662F;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x662F;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x7684;&#xFF1A;<br>&#x6211;&#x4EEC;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;funciton&#x4E5F;&#x662F;&#x5BF9;&#x8C61;&#xFF08;Function&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4E86;&#x91CD;&#x590D;&#xFF0C;&#x8FD9;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x82E5;&#x662F;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5916;&#x90E8;&#x53BB;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5185;&#x53BB;&#x8C03;&#x7528;&#x5462;&#xFF1F;&#x8FD9;&#x6837;&#x5B50;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5728;&#x5168;&#x5C40;&#x4E2D;&#x5B9A;&#x4E49;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x7684;&#x65B9;&#x6CD5;&#x4E86;&#x3002;&#x3002;&#x800C;&#x4E14;&#x5168;&#x5C40;&#x4E2D;&#x7684;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x53EA;&#x4E3A;&#x4E86;&#x7ED9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x8C03;&#x7528;&#x3002;&#x3002;&#x5168;&#x5C40;&#x5C31;&#x540D;&#x4E0D;&#x526F;&#x5B9E;&#x4E86;&#x3002;<br>&#x90A3;&#x4E48;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x5C31;&#x6C24;&#x6C32;&#x800C;&#x751F;&#x4E86;&#xFF01;&#xFF01;<br>&#x8FD9;&#x4E5F;&#x662F;&#x539F;&#x578B;&#x94FE;&#x7684;&#x8D77;&#x3002;&#x7ED3;&#x5408;&#x6211;&#x4EEC;&#x4E4B;&#x524D;new&#x7684;<em>protol</em>&#x7684;&#x6307;&#x5411;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#xFF0C;&#x539F;&#x578B;&#x4E0E;&#x539F;&#x578B;&#x94FE;&#x662F;&#x4E3A;&#x4E86;&#x7EE7;&#x627F;&#x4EE5;&#x53CA;&#x89E3;&#x51B3;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x4E0D;&#x5FC5;&#x8981;&#x590D;&#x5199;&#x800C;&#x8BDE;&#x751F;&#x7684;&#xFF0C;&#x5B83;&#x662F;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;<br>&#x6211;&#x521B;&#x5EFA;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x539F;&#x578B;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x6307;&#x5411;&#x51FD;&#x6570;&#x7684;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x4E3A;&#x8FD9;&#x4E2A;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x7684;&#x5C5E;&#x6027;&#x4E0E;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x88AB;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x4F8B;&#x6240;&#x516C;&#x7528;&#x3002;&#x5173;&#x4E8E;&#x539F;&#x578B;&#x4E0E;&#x539F;&#x578B;&#x94FE;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x8D58;&#x8FF0;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x8C08;&#x5173;&#x4E8E;&#x7EE7;&#x627F;&#x7684;&#x95EE;&#x9898;&#x3002;<br>&#x90A3;&#x4E48;&#x6709;&#x4E86;&#x539F;&#x578B;&#x5C5E;&#x6027;&#xFF0C;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x65F6;&#x5C31;&#x4E0D;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x4E86;&#x5417;&#xFF1F;<br>&#x4E0D;&#xFF0C;&#x539F;&#x578B;&#x7684;&#x5F0A;&#x75C5;&#x5C31;&#x5728;&#x4E8E;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x53BB;&#x5BF9;&#x5171;&#x4EAB;&#x7684;&#x5C5E;&#x6027;&#x8FDB;&#x884C;&#x8986;&#x76D6;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x65F6;&#x57FA;&#x672C;&#x503C;&#x90A3;&#x8FD8;&#x597D;&#xFF08;&#x6570;&#x5B57;&#xFF0C;&#x5B57;&#x7B26;&#x521B;&#xFF0C;&#x5E03;&#x5C14;&#x503C;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x5C31;&#x6709;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8986;&#x76D6;&#x57FA;&#x672C;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x5B9E;&#x4F8B;&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x503C;&#x662F;&#x5728;&#x6808;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x539F;&#x578B;&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x503C;&#x8FDB;&#x884C;&#x4E86;&#x590D;&#x5236;&#x3002;&#x5F00;&#x8F9F;&#x4E86;&#x65B0;&#x7684;&#x5185;&#x5B58;&#x53BB;&#x4FDD;&#x5B58;&#x57FA;&#x672C;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x5C31;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5B9E;&#x4F8B;&#x4E2D;&#x7684;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x4E0E;&#x539F;&#x578B;&#x4E2D;&#x7684;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;&#x662F;&#x653E;&#x5728;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x8986;&#x76D6;&#x6216;&#x8005;&#x590D;&#x5199;&#x65F6;&#xFF0C;&#x4F1A;&#x662F;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#x4E2D;&#x76F8;&#x5E94;&#x7684;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x4E0D;&#x5E0C;&#x671B;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5404;&#x4E2A;&#x5B9E;&#x4F8B;&#x5404;&#x81EA;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x4F8B;&#x5C5E;&#x6027;&#x3002;<br>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E5F;&#x7B80;&#x5355;&#xFF1A;<br>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x65B9;&#x6CD5;&#x51FD;&#x6570;&#x5355;&#x72EC;&#x7684;&#x5206;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x4F7F;&#x7528;this&#x6765;&#x5199;&#x5C5E;&#x6027;&#xFF08;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;)&#xFF0C;&#x4F1A;&#x7528;&#x539F;&#x578B;&#x6765;&#x5199;&#x65B9;&#x6CD5;&#x3002;&#x5C31;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;(&#x7EC4;&#x5408;&#x53EA;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6A21;&#x5F0F;&#x548C;&#x539F;&#x578B;&#x6A21;&#x5F0F;)</p>
<pre><code>function Person(name,age,height,friend){
      this.name = name;
      this.age = age;
      this.height = height;
      this.friends = [&quot;me&#x201C;,&quot;me&quot;,&quot;me&quot;];
}
Person.prototype = {
    constructor : Person,
    sayName = function(){
         alert(this.name)
    }
}
</code></pre><p>&#x8FD9;&#x6837;&#x4E00;&#x6765;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x5206;&#x5F00;&#x4E86;&#xFF01;<br>&#x4F46;&#x662F;&#x65B9;&#x6CD5;&#x5374;&#x5199;&#x5728;&#x4E86;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5916;&#x90E8;&#xFF0C;&#x89E3;&#x51B3;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;if&#x8BED;&#x53E5;&#xFF1A;&#x82E5;&#x51FD;&#x6570;&#x539F;&#x578B;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x8BE5;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x6DFB;&#x52A0;&#x8BE5;&#x65B9;&#x6CD5;</p>
<pre><code>if(type of this.sayName != function){
Person.prototype.sayName = function(){
       alert(this.name)    
}
}
</code></pre><p>&#x8FD9;&#x6837;&#x5B50;&#x53BB;&#x6DFB;&#x52A0;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x521D;&#x6B21;&#x8C03;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x6267;&#x884C;&#x3002;&#x4F3A;&#x5019;&#x539F;&#x578B;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x591A;&#x4F59;&#x7684;&#x4FEE;&#x6539;&#x4E86;&#x3002;<br>&#x81F3;&#x4E8E;&#x5BC4;&#x751F;&#x5F0F;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6A21;&#x5F0F;&#xFF0C;&#x548C;&#x7A33;&#x59A5;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6A21;&#x5F0F;&#x90FD;&#x662F;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x4F1A;&#x4F7F;&#x7528;&#x5230;&#x7684;~&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x53EA;&#x7B80;&#x5355;&#x7684;&#x63D0;&#x4E00;&#x4E0B;&#xFF1A;<br>&#x524D;&#x8005;&#x51FA;&#x4E86;&#x4F7F;&#x7528;&#x4E86;new&#x4EE5;&#x5916;&#x4E0E;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#xFF0C;&#x4ED6;&#x9700;&#x8981;&#x8FD4;&#x56DE;&#x7684;&#x5BF9;&#x8C61;&#x4E0E;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E0E;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x539F;&#x578B;&#x5C5E;&#x6027;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6784;&#x9020;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x7684;&#x5BF9;&#x8C61;&#x4E0E;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5916;&#x90E8;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x3002;&#x5B83;&#x5728;&#x7279;&#x6B8A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x4E3A;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#x800C;&#x7A33;&#x59A5;&#x6784;&#x9020;&#x6A21;&#x5F0F;&#x4ED6;&#x5C06;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x76F4;&#x63A5;&#x7ED9;&#x5185;&#x90E8;&#x65B9;&#x6CD5;&#x51FD;&#x6570;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#x51FA;&#x4E86;&#x95ED;&#x5305;&#x51FD;&#x6570;&#xFF0C;&#x5916;&#x90E8;&#x662F;&#x8BBF;&#x95EE;&#x4E0D;&#x5230;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x3002;<br>&#x5173;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x9020;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5927;&#x81F4;&#x8BB2;&#x5B8C;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x91CC;&#x662F;&#x7EE7;&#x627F;</p>
<h3 id="&#x7EE7;&#x627F;"><a href="#&#x7EE7;&#x627F;" class="headerlink" title="&#x7EE7;&#x627F;"></a>&#x7EE7;&#x627F;</h3><p>&#x5173;&#x4E8E;&#x7EE7;&#x627F;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x8C08;&#x5230;&#x4E86;&#xFF0C;&#x539F;&#x578B;&#x94FE;&#x5C31;&#x662F;&#x7528;&#x6765;&#x7EE7;&#x627F;&#x7684;&#xFF0C;&#x5B50;&#x7C7B;&#x901A;&#x8FC7;&#x539F;&#x578B;&#x94FE;&#x53EF;&#x4EE5;&#x96C6;&#x6210;&#x5230;&#x7236;&#x7C7B;&#x7684;&#x5C5E;&#x6027;&#x4E0E;&#x65B9;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#x539F;&#x578B;&#x94FE;&#x4E5F;&#x662F;&#x6709;&#x7F3A;&#x9677;&#x7684;&#xFF0C;&#x9996;&#x5148;&#x5F53;&#x7528;&#x5B57;&#x9762;&#x91CF;&#x521B;&#x5EFA;&#x539F;&#x578B;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x4F1A;&#x91CD;&#x5199;&#x539F;&#x578B;&#x94FE;&#xFF0C;&#x5207;&#x65AD;&#x73B0;&#x6709;&#x539F;&#x578B;&#x4E0E;&#x4E4B;&#x524D;&#x5B9E;&#x4F8B;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B9E;&#x4F8B;&#x5F15;&#x7528;&#x7684;&#x4F9D;&#x7136;&#x662F;&#x4E4B;&#x524D;&#x7684;&#x539F;&#x578B;&#x3002;&#x518D;&#x8005;&#xFF0C;&#x7531;&#x4E8E;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x4E0D;&#x4F1A;&#x88AB;&#x6DF1;&#x590D;&#x5236;&#xFF0C;&#x6240;&#x4EE5;&#x4F1A;&#x88AB;&#x5B9E;&#x4F8B;&#x6539;&#x5199;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5462;&#xFF1F;<br>&#x501F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code>function Baba(){
   this.color = [&quot;red&quot;,&quot;blue&quot;];
}
function Erzi(){
   Baba.call(this);
}
</code></pre><p>&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x5F53;&#x5B9E;&#x4F8B;&#x5316;&#x4E86;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#x540E;&#xFF0C;&#x5B50;&#x7C7B;&#x5BF9;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x5C5E;&#x6027;&#x7684;&#x590D;&#x5199;&#x5C31;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x539F;&#x578B;&#x4E86;&#xFF01;<br>&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x4ECE;&#x5B50;&#x7C7B;&#x4E2D;&#x60F3;&#x7236;&#x7C7B;&#x4F20;&#x9012;&#x53C2;&#x6570;&#x3002;&#x5728;&#x5B50;&#x7C7B;&#x4E2D;&#x6DFB;&#x52A0;this.age = 23&#x540E;,&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x5B50;&#x7C7B;&#x80FD;&#x591F;&#x6DFB;&#x52A0;&#x5E74;&#x9F84;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#xFF01;<br>&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x5C31;&#x53C8;&#x53D1;&#x751F;&#x4E86;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x4E86;&#xFF01;&#x65B9;&#x6CD5;&#x4E0D;&#x80FD;&#x591F;&#x590D;&#x7528;&#xFF01;&#xFF01;&#xFF01;<br>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53C8;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x539F;&#x6765;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x65F6;&#x6240;&#x8FD0;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x4E86;&#xFF01;&#x628A;&#x65B9;&#x6CD5;&#x7528;&#x539F;&#x578B;&#x6765;&#x521B;&#x5EFA;&#xFF0C;&#x5C5E;&#x6027;&#x4F7F;&#x7528;this&#x521B;&#x5EFA;&#x3002;&#x518D;&#x4F7F;&#x7528;&#x501F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#x7EE7;&#x627F;&#x5C5E;&#x6027;&#xFF0C;&#x4F7F;&#x7528;&#x539F;&#x578B;&#x94FE;&#x6765;&#x7EE7;&#x627F;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x4FDD;&#x8BC1;&#x4E86;&#x5B9E;&#x4F8B;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x800C;&#x4E14;&#x65B9;&#x6CD5;&#x4E0D;&#x4F1A;&#x91CD;&#x590D;&#x7684;&#x5199;&#x4E86;&#x3002;</p>
<h4 id="&#x53E6;&#x5916;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;"><a href="#&#x53E6;&#x5916;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;" class="headerlink" title="&#x53E6;&#x5916;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;"></a>&#x53E6;&#x5916;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;</h4><p>&#x539F;&#x578B;&#x5F0F;&#x7EE7;&#x627F;&#xFF1A;</p>
<pre><code>function object(o){
    function F(){}
   F.prototype = o;
   return new F();
}
</code></pre><p>&#x8FD9;&#x6837;&#x5B50;&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x7EE7;&#x627F;&#x76F8;&#x5F53;&#x4E8E;&#x5BF9;&#x4F20;&#x5165;&#x7684;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x6B21;&#x524D;&#x590D;&#x5236;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x6709;&#x539F;&#x578B;&#x94FE;&#x7EE7;&#x627F;&#x7684;&#x4E00;&#x4E2A;&#x6BDB;&#x75C5;&#xFF0C;&#x5C31;&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x59CB;&#x7EC8;&#x4F1A;&#x5171;&#x4EAB;&#x76F8;&#x5E94;&#x7684;&#x503C;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x60F3;&#x8BA9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x59CB;&#x7EC8;&#x4E0E;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x79CD;&#x7EE7;&#x627F;&#x65B9;&#x5F0F;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x9002;&#x5408;&#x7684;&#x3002;&#x3002;&#x800C;&#x4E14;&#x5728;ES5&#x4E2D;&#x89C4;&#x8303;&#x5316;&#x4E86;&#x539F;&#x578B;&#x5F0F;&#x7EE7;&#x627F;&#xFF1A;Object.create();&#x5728;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x65F6;&#x4E0E;Object&#xFF08;)&#x65B9;&#x6CD5;&#x7684;&#x884C;&#x4E3A;&#x76F8;&#x540C;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B57;&#x9762;&#x91CF;&#x7684;&#x5F62;&#x5F0F;&#x5BF9;&#x5DF2;&#x6709;&#x7684;&#x5C5E;&#x6027;&#x8FDB;&#x884C;&#x590D;&#x5199;&#x3002;<br>&#x5BC4;&#x751F;&#x5F0F;&#x7EE7;&#x627F;&#xFF1A;</p>
<pre><code>function(){
var  clone = Object(original);
clone.sayHi = function(){
alert(&apos;Hi&apos;);
};
return clone;
}
</code></pre><p>&#x51FD;&#x6570;&#x63A5;&#x6536;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x5DF2;&#x6709;&#x5BF9;&#x8C61;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x6DFB;&#x52A0;&#x65B9;&#x6CD5;sayHi~&#xFF01;<br>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x80FD;&#x591F;&#x52A0;&#x5F3A;&#x5BF9;&#x76F8;&#x5173;&#x3002;<br>&#x4E4B;&#x524D;&#x8BB2;&#x5230;&#x4E86;&#x7EC4;&#x5408;&#x7EE7;&#x627F;&#x7684;&#x65B9;&#x6CD5;~&#x7EC4;&#x5408;&#x7EE7;&#x627F;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6700;&#x5E38;&#x7528;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E5F;&#x5B58;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;~&#x518D;&#x7EE7;&#x627F;&#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;new&#x8C03;&#x7528;&#x4E86;&#x7236;&#x7C7B;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x5B50;&#x7C7B;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x501F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x53C8;&#x8C03;&#x7528;&#x4E86;&#x4E00;&#x904D;&#x7236;&#x7C7B;&#x7684;&#x51FD;&#x6570;&#x3002;&#x4E00;&#x5171;&#x6709;&#x4E24;&#x6B21;&#x7236;&#x7C7B;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#xFF1A;</p>
<pre><code>function Baba(name){
   this.name = name;
   this.colors = [&quot;red&quot;,&quot;blue&quot;,&quot;black&quot;]
}
Baba.prototype.sayName = function(){   alert(this.name)   }
function erzi(name,age){
   Baba.call(this,name);
   this.age = age;
}
Erzi.prototype = new Baba();
Erzi.prototype.constructor = erzi;
Erzi.prototype.sayAge = function(){  alert(this.age);  };
</code></pre><p>&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;&#x7238;&#x7238;&#x65F6;&#xFF08;&#x539F;&#x578B;&#x7EE7;&#x627F;&#x65F6;&#xFF09;&#xFF0C;&#x513F;&#x5B50;&#x7684;&#x539F;&#x578B;&#x4F1A;&#x4EA7;&#x751F;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x540D;&#x5B57;&#x548C;&#x989C;&#x8272;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x8C03;&#x7528;&#x65F6;&#xFF08;&#x8C03;&#x7528;&#x513F;&#x5B50;&#x6784;&#x9020;&#x51FD;&#x6570;&#x65F6;&#xFF09;&#xFF0C;&#x4F1A;&#x518D;&#x6B21;&#x521B;&#x5EFA;&#x5B9E;&#x4F8B;&#x5C5E;&#x6027;&#x540D;&#x5B57;&#x548C;&#x989C;&#x8272;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#x4F1A;&#x628A;&#x539F;&#x578B;&#x4E2D;&#x4E24;&#x4E2A;&#x540C;&#x540D;&#x5C5E;&#x6027;&#x5C4F;&#x853D;&#x6389;&#x3002;&#x513F;&#x5B50;&#x7684;&#x539F;&#x578B;&#x5F97;&#x5230;&#x4E86;2&#x7EC4;&#x540C;&#x6837;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5BC4;&#x751F;&#x7EC4;&#x5408;&#x5F0F;&#x7EE7;&#x627F;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code>function jishengzuhejicheng(Erzi,Baba){
   var prototype = Object(Baba.prototype);
   prototype.constructor = Erzi;
   Erzi.prototype = prototype
}
</code></pre><p> &#x4F7F;&#x7528;&#x539F;&#x578B;&#x94FE;&#x7EE7;&#x627F;&#x65B9;&#x6CD5;&#x7684;&#x6B65;&#x9AA4;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x66FF;&#x6362;&#x4E3A;&#xFF1A;</p>
<pre><code>zuhejishengjicheng(Erzi,Baba);
Erzi.prototype.sayAge = function(){
      alert(this.age)
}
</code></pre><p>&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x524D;&#x590D;&#x5236;&#x7236;&#x7EA7;&#x7684;&#x539F;&#x578B;&#x6765;&#x8FDB;&#x884C;&#x7EE7;&#x627F;&#xFF0C;&#x4EE5;&#x9632;&#x5728;&#x7EE7;&#x627F;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7236;&#x7EA7;&#x5C5E;&#x6027;&#x7684;&#x91CD;&#x5199;&#x3002;&#x3002;<br>&#x6700;&#x540E;&#x4ECB;&#x7ECD;&#x7684;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x6700;&#x7406;&#x60F3;&#x7684;&#x7EE7;&#x627F;&#x8303;&#x5F0F;&#x5566;&#xFF01;</p>
<h3 id="&#x7ED3;&#x8BED;"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED;</h3><p>&#x6700;&#x8FD1;&#x5728;&#x62C9;&#x94A9;&#x6295;&#x4E86;&#x7B80;&#x5386;&#x4E86;&#x3002;&#x3002;&#x7136;&#x800C;&#x4E0D;&#x51FA;&#x4E00;&#x5929;&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x4E0D;&#x5408;&#x9002;&#x3002;&#x3002;Orz&#x3002;&#x4E0B;&#x4E00;&#x7BC7;&#x5199;&#x4E00;&#x5199;&#x5173;&#x4E8E;HTTP&#x548C;AJAX&#xFF0C;&#x8FD8;&#x6709;&#x5173;&#x4E8E;&#x524D;&#x7AEF;&#x4F18;&#x5316;&#x7684;&#x5185;&#x5BB9;&#x5427;~&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x4F1A;&#x63D0;&#x5230;&#x5427;~&#xFF08;&#x7ACB;&#x4E2A;FLAG&#xFF1A;&#x6211;&#x8981;&#x5B66;&#x597D;React&#xFF0C;&#x6211;&#x8981;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x4E2A;CSS3D&#x52A8;&#x753B;&#x7684;NPM&#x6A21;&#x5757;&#xFF01;&#xFF01;&#xFF01;&#xFF09;</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/javascript/" rel="tag">#javascript</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/26/ten/" rel="next" title="关于闭包、闭包应用和ES6的let">
                <i class="fa fa-chevron-left"></i> 关于闭包、闭包应用和ES6的let
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/10/11/12/" rel="prev" title="ES6的模块功能">
                ES6的模块功能 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://raw.githubusercontent.com/johanzhu/johanzhu.github.io/master/images/avatar.PNG"
               alt="Johan Zhu" />
          <p class="site-author-name" itemprop="name">Johan Zhu</p>
          <p class="site-description motion-element" itemprop="description">Time you enjoy wasting, was not wasted.</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">18</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#前言"><span class="nav-number">1.</span> <span class="nav-text">前言</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#JS对象构建"><span class="nav-number">2.</span> <span class="nav-text">JS对象构建</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#继承"><span class="nav-number">3.</span> <span class="nav-text">继承</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#另外两种方法"><span class="nav-number">3.1.</span> <span class="nav-text">另外两种方法</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#结语"><span class="nav-number">4.</span> <span class="nav-text">结语</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Johan Zhu</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  
  

  

  

</body>
</html>
