<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="interview," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x524D;&amp;#x8A00;= =&amp;#xFF01;&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x6211;&amp;#x4EBA;&amp;#x751F;&amp;#x4E2D;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B21;&amp;#x9762;&amp;#x8BD5;&amp;#x3002;&amp;#x3002;&amp;#x611F;&amp;#x89C9;&amp;#x8FD8;&amp;#x7B97;&amp;#x4E0D;&amp;#x9519;&amp;#x3002;&amp;#x71">
<meta property="og:type" content="article">
<meta property="og:title" content="面试小总结">
<meta property="og:url" content="http://yoursite.com/2016/10/25/20/index.html">
<meta property="og:site_name" content="JohanZhu's Blog">
<meta property="og:description" content="&amp;#x524D;&amp;#x8A00;= =&amp;#xFF01;&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x6211;&amp;#x4EBA;&amp;#x751F;&amp;#x4E2D;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B21;&amp;#x9762;&amp;#x8BD5;&amp;#x3002;&amp;#x3002;&amp;#x611F;&amp;#x89C9;&amp;#x8FD8;&amp;#x7B97;&amp;#x4E0D;&amp;#x9519;&amp;#x3002;&amp;#x71">
<meta property="og:updated_time" content="2016-10-26T03:58:26.202Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="面试小总结">
<meta name="twitter:description" content="&amp;#x524D;&amp;#x8A00;= =&amp;#xFF01;&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x6211;&amp;#x4EBA;&amp;#x751F;&amp;#x4E2D;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B21;&amp;#x9762;&amp;#x8BD5;&amp;#x3002;&amp;#x3002;&amp;#x611F;&amp;#x89C9;&amp;#x8FD8;&amp;#x7B97;&amp;#x4E0D;&amp;#x9519;&amp;#x3002;&amp;#x71">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2016/10/25/20/"/>

  <title> 面试小总结 | JohanZhu's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">JohanZhu's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                面试小总结
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-10-25T18:43:31+08:00" content="2016-10-25">
              2016-10-25
            </time>
          </span>

          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h3 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h3><p>= =&#xFF01;&#x4ECA;&#x5929;&#x662F;&#x6211;&#x4EBA;&#x751F;&#x4E2D;&#x7B2C;&#x4E00;&#x6B21;&#x9762;&#x8BD5;&#x3002;&#x3002;&#x611F;&#x89C9;&#x8FD8;&#x7B97;&#x4E0D;&#x9519;&#x3002;&#x7136;&#x800C;&#x3002;&#x3002;&#x3002;&#x5F88;&#x591A;&#x8FD8;&#x662F;&#x6CA1;&#x7B54;&#x4E0A;&#x6765;&#x3002;&#x611F;&#x89C9;&#x5BF9;&#x65B9;&#x6280;&#x672F;&#x5BF9;&#x5B9E;&#x4E60;&#x751F;&#x7684;&#x8981;&#x6C42;&#x4E5F;&#x5E76;&#x6CA1;&#x6709;&#x5F88;&#x4E25;&#x82DB;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x80AF;&#x5B9A;&#x8FD8;&#x662F;&#x8981;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x7684;&#xFF01;<br><a id="more"></a></p>
<h3 id="&#x6B63;&#x6587;"><a href="#&#x6B63;&#x6587;" class="headerlink" title="&#x6B63;&#x6587;"></a>&#x6B63;&#x6587;</h3><p>&#x9996;&#x5148;&#x7B14;&#x8BD5;&#x9898;&#x76EE;&#x3002;&#x73B0;&#x5728;&#x56DE;&#x5FC6;&#x7684;&#x8D77;&#x6765;&#x7684;&#xFF1A;&#x6211;&#x7684;&#x591A;&#x9009;&#x9898;&#x9519;&#x4E86;&#x597D;&#x591A;&#x3002;&#x3002;&#x4E00;&#x9053;typeof&#x7684;&#x9898;&#x76EE;&#x5FD8;&#x8BB0;&#x4E86;&#x3002;object.prototype.tostring.call(o) === [object,object]<br>&#x7136;&#x540E;&#x9009;&#x9879;&#x662F;{},new object();new Function();function a(){}  new a();&#x6211;&#x4EEC;&#x6765;&#x5B9E;&#x9A8C;&#x4E00;&#x4E0B;&#x3002;&#x3002;<br>&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x51FA;&#x4E86;new Function()&#x4EE5;&#x5916;&#x90FD;&#x662F;object object&#x3002;new Function()&#x662F;object Function&#x3002;&#xFF01;&#xFF01;&#x6211;&#x4E4B;&#x524D;&#x9009;&#x7684;&#x5BF9;&#x7684;&#xFF01;&#xFF01;<br>&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6CA1;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x3002;&#x5982;&#x679C;&#x7528;typeof &#x7684;&#x8BDD;&#x90FD;&#x4F1A;&#x8FD4;&#x56DE;object&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E0B;<br>&#x6570;&#x7EC4;&#x8FD4;&#x56DE;object Array<br>&#x5B57;&#x7B26;&#x4E32;&#x8FD4;&#x56DE;object String<br>&#x5BF9;&#x8C61;&#x8FD4;&#x56DE;object object<br>&#x6B63;&#x5219;&#x8FD4;&#x56DE;object RegExg<br>&#x6570;&#x5B57;&#x8FD4;&#x56DE;object Number<br>undefined&#x8FD4;&#x56DE;Undefined<br>null&#x8FD4;&#x56DE;object null<br>&#x5176;&#x4ED6;&#x7684;&#x6211;&#x5FD8;&#x8BB0;&#x4E86;&#x3002;&#x3002;&#x5E0C;&#x671B;&#x5F97;&#x5230;&#x8BD5;&#x5377;&#x554A;&#x3002;&#x3002;<br>&#x7136;&#x540E;&#x9762;&#x8BD5;&#x7B54;&#x9898;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x6709;&#x70B9;&#x50BB;&#x903C;&#xFF0C;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x5C31;&#x6253;&#x4E86;&#x51E0;&#x4E2A;&#x3002;&#x3002;&#x539F;&#x578B;&#x94FE;&#x4E5F;&#x6CA1;&#x7B54;&#x6700;&#x540E;&#x7684;&#x4E24;&#x79CD;&#x6D41;&#x5411;&#x3002;&#x3002;<br>&#x57FA;&#x7840;&#x7C7B;&#x578B;&#x662F;&#x4E0A;&#x9762;&#x8C08;&#x5230;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6570;&#x7EC4;&#xFF0C;&#x6B63;&#x5219;&#xFF0C;&#x6570;&#x5B57;&#xFF0C;undefined&#xFF0C;null,&#x8FD8;&#x6709;&#x5B57;&#x9762;&#x91CF;&#x5BF9;&#x8C61;&#xFF01;&#xFF01;&#xFF01;&#xFF01;(&#x8FD9;&#x91CC;&#x662F;{})<br>&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x6709;Object&#xFF0C;Array&#xFF0C;Date&#xFF0C;RegExp&#xFF0C;Function&#x3002;<br>&#x9664;&#x6B64;&#x4E4B;&#x5916;ES&#x6807;&#x51C6;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;3&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;Boolean,Number&#x548C;String.<br>&#x55EF;&#x3002;&#x3002;&#x56DE;&#x5FC6;&#x3002;&#x3002;&#x7136;&#x540E;&#x9009;&#x62E9;&#x90FD;&#x5FD8;&#x4E86;&#x3002;&#x5355;&#x9009;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x3002;&#x5927;&#x9898;&#xFF01;&#x5148;&#x4E0D;&#x8C08;&#x90A3;&#x4E2A;slice&#x7684;&#x9898;&#x76EE;&#x3002;&#x3002;<br>&#x9996;&#x5148;&#x8FD9;&#x91CC;&#x8C08;&#x4E00;&#x8C08;new&#x3002;&#x3002;&#x8FD9;&#x4E2A;&#x4E66;&#x4E0A;&#xFF0C;&#x548C;&#x7F51;&#x4E0A;&#x8BB2;&#x7684;&#x5F88;&#x591A;&#x7248;&#x672C;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x4E5F;&#x6709;&#x70B9;&#x8499;&#x3002;&#x3002;new&#x7684;&#x5DE6;&#x8FB9;&#x53EF;&#x4EE5;&#x662F;a&#xFF08;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x6808;&#x5185;&#x7684;&#x7A7A;&#x95F4;&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5B50;&#x7C7B;&#x7684;&#x539F;&#x578B;&#xFF08;&#x7EE7;&#x627F;&#x7528;&#xFF09;<br>new&#x5230;&#x5E95;&#x5E72;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;<br>&#x9996;&#x5148;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5BF9;&#x8C61;<br>&#x6211;&#x4EEC;&#x628A;&#x5DE6;&#x4FA7;&#x7684;&#x5185;&#x5BB9;&#x7528;Left&#x8868;&#x793A;<br>&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;var Left = {};&#x5806;&#x5185;&#x5B58;&#x4E2D;&#x5F00;&#x8F9F;&#x65B0;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x7684;Left&#x662F;&#x6307;&#x5411;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x3002;<br>&#x7136;&#x540E;Left.<em>protol</em> = Super.prototype&#xFF08;&#x65E2;&#x7136;&#x662F;new&#x603B;&#x6709;new&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x91CC;&#x628A;&#x6211;&#x4EEC;&#x65B0;&#x7684;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x539F;&#x578B;&#x6307;&#x9488;&#x6307;&#x5411;&#x6211;&#x4EEC;new&#x7684;&#x90A3;&#x4E2A;&#x4E1C;&#x897F;&#x7684;&#x539F;&#x578B;&#xFF09;&#x3002;&#x8FD9;&#x91CC;&#x5982;&#x679C;&#x662F;&#x7EE7;&#x627F;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4EA7;&#x751F;&#x4E86;&#x539F;&#x578B;&#x94FE;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5B9E;&#x4F8B;&#x5316;&#x5BF9;&#x8C61;&#x7684;&#x8BDD;&#x5C31;&#x4E0D;&#x662F;&#x4E86;&#x3002;<br>&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E00;&#x6B65;&#xFF0C;Super.call(Left)&#x3002;&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x628A;&#x7236;&#x7C7B;&#x7684;thi&#x7ED1;&#x5B9A;&#x5230;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#xFF01;&#x8FD9;&#x4E00;&#x6B65;&#x6709;&#x70B9;&#x50CF;&#x501F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x7EE7;&#x627F;&#x65B9;&#x6CD5;&#x4E86;&#x3002;<br>&#x6700;&#x540E;&#x9690;&#x5F0F;&#x7684;&#x8FD4;&#x56DE;this&#x3002;<br>OK&#xFF0C;&#x590D;&#x4E60;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x5C31;&#x53C8;&#x6709;&#x53D1;&#x73B0;&#x4E86;&#x3002;<br>&#x5F53;&#x5B9E;&#x4F8B;&#x5316;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x521B;&#x9020;&#x4E86;&#x65B0;&#x7684;object&#xFF0C;&#x628A;object&#x7684;<em>protol</em> &#x6307;&#x5411;&#x7236;&#x7C7B;&#xFF0C;&#x4E4B;&#x540E;Super.call(o)&#x7ED1;&#x5B9A;this&#x4F5C;&#x7528;&#x57DF;&#x3002;&#x4F7F;&#x5F97;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E2D;&#x7684;this&#x5B9A;&#x4E49;&#x7684;&#x503C;&#x80FD;&#x591F;&#x5728;&#x5B50;&#x7C7B;&#x4E2D;&#x4F53;&#x73B0;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;this&#x5728;&#x5B50;&#x7C7B;&#x4E2D;&#x90FD;&#x91CD;&#x5199;&#x4E86;&#x4E00;&#x6B21;&#xFF0C;&#x5B50;&#x7C7B;&#x5C31;&#x83B7;&#x5F97;&#x4E86;&#x7236;&#x7C7B;&#x7684;&#x6240;&#x6709;this&#x4E86;&#xFF01;OK!&#x8BF4;&#x7740;&#x8BF4;&#x7740;&#x53D8;&#x6210;&#x4E86;&#x7EE7;&#x627F;&#x4E86;&#x3002;&#x3002;&#x5176;&#x5B9E;&#x5B9E;&#x4F8B;&#x5316;&#x548C;&#x7EE7;&#x627F;&#x5F88;&#x50CF;&#x3002;&#x3002;&#x771F;&#x7684;&#x3002;<br>&#x597D;&#x4E86;&#x3002;&#x5F04;&#x660E;&#x767D;&#x4E86;&#x3002;&#x3002;<br>&#x63A5;&#x4E0B;&#x91CC;&#x628A;&#x6700;&#x540E;&#x4E00;&#x9898;&#x5B9E;&#x9A8C;&#x4E00;&#x4E0B;.&#x2019;ffffff&#x2019;&#x66FF;&#x6362;&#x6210;&#x2019;255,255,255&#x2019;.&#x5B9E;&#x9A8C;&#x8BC1;&#x660E;- -&#x6211;&#x5F53;&#x65F6;&#x5199;&#x7684;replace&#x6709;&#x70B9;&#x95EE;&#x9898;&#x3002;&#x3002;&#x7ED3;&#x679C;&#x662F;255,255,255&#xFF0C;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x9017;&#x53F7;&#x3002;&#x3002;&#x6CA1;&#x5173;&#x7CFB;&#x3002;splice&#x4E00;&#x4E0B;&#x5C31;&#x597D;&#x4E86;0.0<br>&#x7136;&#x540E;&#x5C31;&#x662F;&#x4E24;&#x4E2A;&#x54E5;&#x54E5;&#x53E3;&#x5934;&#x95EE;&#x7684;&#x95EE;&#x9898;&#x4E86;&#xFF01;&#x7B2C;&#x4E00;&#x4E2A;&#x3002;&#x539F;&#x578B;&#x94FE;&#x6211;&#x6CA1;&#x8BF4;&#x597D;&#x3002;&#x5B9E;&#x4F8B;&#x5316;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x539F;&#x578B;&#x90A3;&#x4E48;function&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x4E5F;&#x4F1A;&#x5728;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x91CD;&#x5199;&#x4E00;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x662F;&#x4E0D;&#x7B49;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x4E2D;&#x90FD;&#x88AB;&#x91CD;&#x5199;&#x4E86;&#x4E00;&#x6B21;&#x3002;&#x8FD9;&#x6837;&#x91CD;&#x590D;&#x7684;&#x53BB;&#x5199;&#x540C;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x6240;&#x6709;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x4E86;&#x539F;&#x578B;&#x673A;&#x5236;&#x3002;&#xFF08;OK&#x8FD9;&#x91CC;&#x90A3;&#x65F6;&#x5019;&#x8BF4;&#x7684;&#x4E0D;&#x6E05;&#x695A;&#x3002;&#xFF09;<br>&#x518D;&#x5C31;&#x662F;canvas&#xFF08;JS&#xFF09;&#x548C;CSS&#x52A8;&#x753B;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x9996;&#x5148;CSS&#x52A8;&#x753B;&#xFF1A;CSS3&#x662F;&#x5B58;&#x5728;&#x6709;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#x7684;&#xFF0C;JS&#x5C31;&#x6CA1;&#x6709;&#x4E86;&#x3002;canvas&#x7684;&#x8BDD;&#xFF0C;&#x4E5F;&#x6709;&#x517C;&#x5BB9;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;<br>&#x901A;&#x8FC7;JS&#x505A;&#x52A8;&#x753B;&#x5C31;&#x662F;&#x64CD;&#x7EB5;&#x56FE;&#x7247;&#x4E86;&#x3002;&#x64CD;&#x7EB5;&#x56FE;&#x7247;&#x914D;&#x5408;DIV&#x80FD;&#x591F;&#x505A;&#x51FA;&#x5F88;&#x591A;&#x6548;&#x679C;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x4E9B;&#x53EA;&#x6709;JS&#x624D;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x3002;<br>&#x4F46;&#x662F;JS&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x6D77;&#x6CB9;&#x5176;&#x4ED6;&#x7684;JS&#x811A;&#x672C;&#xFF0C;&#x6837;&#x5F0F;&#x8BA1;&#x7B97;&#xFF0C;&#x5E03;&#x5C40;&#xFF0C;&#x7ED8;&#x5236;&#x4EFB;&#x52A1;&#x7B49;&#xFF0C;&#x5BF9;&#x5176;&#x5E72;&#x6270;&#xFF0C;&#x5BFC;&#x81F4;&#x7EBF;&#x7A0B;&#x51FA;&#x73B0;&#x963B;&#x585E;&#xFF0C;&#x4ECE;&#x800C;&#x4F1A;&#x5BFC;&#x81F4;&#x4E22;&#x5E27;&#x3002;<br>CSS&#x52A8;&#x753B;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x7ED1;&#x5B9A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E14;CSS&#x52A8;&#x753B;&#x667A;&#x80FD;&#x6682;&#x505C;&#x4E0D;&#x80FD;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x4E0D;&#x80FD;&#x534A;&#x9014;&#x53CD;&#x8F6C;&#x52A8;&#x753B;&#xFF0C;&#x4E0D;&#x80FD;&#x53D8;&#x6362;&#x65F6;&#x95F4;&#x5C3A;&#x5EA6;&#x3002;&#x4E0D;&#x80FD;&#x518D;&#x7279;&#x5B9A;&#x4F4D;&#x7F6E;&#x6DFB;&#x52A0;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;&#x5982;&#x679C;&#x8981;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x7684;&#x52A8;&#x753B;&#xFF0C;&#x4EE3;&#x7801;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x7B28;&#x91CD;&#x3002;<br>&#x4F18;&#x70B9;&#xFF1A;&#x6D4F;&#x89C8;&#x5668;&#x53EF;&#x4EE5;&#x5BF9;&#x52A8;&#x753B;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF01;&#x6D4F;&#x89C8;&#x5668;&#x4F7F;&#x7528;&#x4E0E;requestAnimationFrame&#x7C7B;&#x4F3C;&#x5F97;&#x673A;&#x5236;&#xFF0C;requesetAnimationFrame&#x6BD4;&#x8D77;setTimeout,setInterval&#x5B83;&#x7684;&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#xFF1A;&#x4ED6;&#x80FD;&#x628A;&#x6BCF;&#x4E00;&#x5E27;&#x4E2D;&#x7684;&#x6240;&#x6709;DOM&#x64CD;&#x4F5C;&#x96C6;&#x4E2D;&#x8D77;&#x6765;&#xFF0C;&#x5728;&#x4E00;&#x6B21;&#x91CD;&#x7ED8;&#x6216;&#x56DE;&#x6D41;&#x4E2D;&#x5C31;&#x5B8C;&#x6210;&#xFF0C;&#x5E76;&#x4E14;&#x91CD;&#x7ED8;&#x548C;&#x56DE;&#x6D41;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x7D27;&#x7D27;&#x7684;&#x8DDF;&#x968F;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5237;&#x65B0;&#x9891;&#x7387;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x9891;&#x7387;&#x662F;&#x6BCF;&#x79D2;60&#x5E27;&#x3002;&#x5728;&#x9690;&#x85CF;&#x6216;&#x4E0D;&#x53EF;&#x89C1;&#x5143;&#x7D20;&#x4E2D;&#x7684;requestAnimation&#x4E0D;&#x4F1A;&#x8FDB;&#x884C;&#x91CD;&#x7ED8;&#x6216;&#x8005;&#x56DE;&#x6D41;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x66F4;&#x5C11;&#x7684;CPU,GPU&#x548C;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x91CF;&#x3002;&#x7136;&#x540E;&#x5C31;&#x662F;CSS&#x5F3A;&#x5236;&#x4F7F;&#x7528;&#x786C;&#x4EF6;&#x52A0;&#x901F;&#x3002;&#x901A;&#x8FC7;GPU&#x6765;&#x63D0;&#x9AD8;&#x4E86;&#x52A8;&#x753B;&#x6027;&#x80FD;&#x3002;<br>&#x7136;&#x540E;&#x662F;&#x7B2C;&#x4E8C;&#x4E2A;&#x54E5;&#x54E5;&#x95EE;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x7684;&#x95EE;&#x9898;&#x95EE;&#x7684;&#x5F88;&#x5C11;&#x3002;&#x6211;&#x6CA1;&#x7B54;&#x4E0A;&#x6765;&#x7684;&#x662F;&#x90A3;&#x4E2A;&#x3002;&#x3002;&#x3002;&#xFF1A;react-router&#x7684;&#x539F;&#x7406;&#x4F60;&#x77E5;&#x9053;&#x5417;&#xFF1F;&#x5352;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x54E5;&#x54E5;&#x8BF4;router&#x8FD9;&#x79CD;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x4E2A;&#x5C31;&#x597D;&#xFF1A;&#x5352;&#x3002;&#x3002;<br>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6682;&#x65F6;&#x8FD8;&#x6CA1;&#x7814;&#x7A76;&#x61C2;&#xFF0C;&#x4EE5;&#x540E;&#x6765;&#x586B;&#x5751;&#x628A;&#x3002;</p>
<h3 id="&#x7ED3;&#x8BED;"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED;</h3><p>&#x603B;&#x4E4B;&#xFF0C;&#x4EBA;&#x751F;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#x9762;&#x8BD5;&#x8FD8;&#x7B97;&#x987A;&#x5229;&#x3002;&#x81EA;&#x5DF1;&#x51C6;&#x5907;&#x4E86;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x90FD;&#x6CA1;&#x88AB;&#x95EE;&#x5230;&#x3002;&#x3002;&#x660E;&#x5929;&#x8FD8;&#x6709;&#x9762;&#x8BD5;Fighting!!!</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/interview/" rel="tag">#interview</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/10/23/19/" rel="next" title="关于ES6中的promise">
                <i class="fa fa-chevron-left"></i> 关于ES6中的promise
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/11/03/21/" rel="prev" title="开启lowpoly之旅">
                开启lowpoly之旅 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://raw.githubusercontent.com/johanzhu/johanzhu.github.io/master/images/avatar.PNG"
               alt="Johan Zhu" />
          <p class="site-author-name" itemprop="name">Johan Zhu</p>
          <p class="site-description motion-element" itemprop="description">Time you enjoy wasting, was not wasted.</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">25</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">5</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">7</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#前言"><span class="nav-number">1.</span> <span class="nav-text">前言</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#正文"><span class="nav-number">2.</span> <span class="nav-text">正文</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#结语"><span class="nav-number">3.</span> <span class="nav-text">结语</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Johan Zhu</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  
  

  

  

</body>
</html>
